---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.MaterialId
source: html/8da78a66-2b7d-2231-a112-64cf1cee6c19.htm
---
# Autodesk.Revit.DB.MEPSystemType.MaterialId Property

Indicates the material id that should override the material for all components in the system.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null